insert into Author (name) values
('Роберт Мартин'),      -- 1
('Николай Гоголь'),     -- 2
('Михаил Булгаков'),    -- 3
('Реймонд Самаллиан'),  -- 4
('Дмитрий Глуховский'), -- 5
('Дональт Кнут');       -- 6

insert into Book (name, author_id) values
('Чистая архитектура', 1),  -- 1
('Чистый код', 1),          -- 2
('Шинель', 2),              -- 3
('Тарас Бульба', 2),        -- 4
('Мертвые души', 2),        -- 5
('Мастер и Маграрита', 3),  -- 6
('Морфий', 3),              -- 7
('Как же называется эта книга?', 4), -- 8
('Метро 2033', 5),        -- 9
('Метро 2034', 5),        -- 10
('Искусство программирования', 6); -- 11

insert into Category (name) values
('Программирование'),   -- 1
('Математика'),         -- 2
('Ужасы'),              -- 3
('Роман'),              -- 4
('Фантастика'),         -- 5
('Антиутопия'),         -- 6
('Комедия');            -- 7

insert into Book_Category (book_id, category_id) values
(1, 1), (1, 2), (1, 3),
(2, 1),
(3, 3),
(4, 4),
(5, 7), (5, 4),
(6, 4), (6, 5),
(7, 4),
(8, 2),
(9, 5), (9, 6), (9, 3),
(10, 5), (10, 6), (10, 3),
(11, 1);